Revit 2027 API
UV.IsZeroLength Method
The boolean value indicates whether this 2-D vector is a zero vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsZeroLength()
Public Function IsZeroLength As Boolean
public:
bool IsZeroLength()
member IsZeroLength : unit -> bool
Return Value
Boolean
Remarks
The zero vector's each component is zero within the tolerance (1.0e-09).
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace